{
    "education": "The candidate has a Bachelor of Science in Computer Science. The GPA mentioned is 3.86/4.0.",
    "experience": "This candidate has experience co-leading the development of an interview Chabot that helps fresh graduates and interns with their interview preparations. They were also a member of the Automation team for the Deputy DevDay (FAST Event) and worked on a project involving the authentication of users, conducting interviews, generating reports, and emailing them.",
    "projects": "The candidate has worked on the following projects:1. Co-led the development of an interview Chabot that would help fresh graduates and interns with their interview preparations. This project involved implementing natural language processing (NLP) techniques to improve the Chabot's ability to understand and respond to user queries effectively.2. Stock Clustering: Unfortunately, no further information is provided about this project.3. Restaurant: Unfortunately, no further information is provided about this project.",
    "languages": "The candidate knows the following languages: Python, C/C++, Flask, JavaScript, HTML, CSS, shell, and assembly.",
    "interests": "Based on the provided resume chunks, it is not mentioned whether the candidate has any specific interests.",
    "skills": "Based on the resume chunk provided, the candidate has the following technical skills:- Machine Learning: The candidate has a specialization in Machine Learning, which includes knowledge of supervised and unsupervised learning algorithms, neural networks, and clustering analysis.- Natural Language Processing (NLP): The candidate has implemented NLP techniques to improve a chatbot's ability to understand and respond to user queries effectively.Please note that this information is based on the provided resume chunk and may not include all of the candidate's technical skills.",
    "certifications": "The candidate has not mentioned any professional certifications in their resume.",
    "awards": "It isn't mentioned."
}